In [62]:
from IPython.display import display, HTML
import pandas as pd
import math

import plotly.graph_objects as go
import plotly.express as px
import numpy as np
from scipy import special

<h3> Read OrderDetails Data </h3>

In [67]:
# Read the w3schools Orders data
df_ord_dt = pd.read_excel("Data/w3schools_Data.xlsx", "OrderDetails", skiprows=2)

print("Number of Rows:  ", df_ord_dt.shape[0])
print("Number of Columns:  ", df_ord_dt.shape[1])
df_ord_dt.head(3)

Number of Rows:   518
Number of Columns:   4

   OrderDetailID  OrderID  ProductID  Quantity
0              1    10248         11        12
1              2    10248         42        10
2              3    10248         72         5

In [64]:
df_ord_dt.dtypes

OrderDetailID    int64
OrderID          int64
ProductID        int64
Quantity         int64
dtype: object

<h3> Read Orders Data </h3>

In [65]:
# Read the w3schools Orders data
df_orders = pd.read_excel("Data/w3schools_Data.xlsx", "Orders")

print("Number of Rows:  ", df_orders.shape[0])
print("Number of Columns:  ", df_orders.shape[1])
df_orders.head(3)

Number of Rows:   196
Number of Columns:   5

   OrderID  CustomerID  EmployeeID  OrderDate  ShipperID
0    10248          90           5 1996-07-04          3
1    10249          81           6 1996-07-05          1
2    10250          34           4 1996-07-08          2

<h3>Join</h3>

In [66]:
df_ord_ord_dt = pd.merge(df_ord_dt, df_orders, on='OrderID', how='left')

print("Number of Rows:  ", df_ord_ord_dt.shape[0])
print("Number of Columns:  ", df_ord_ord_dt.shape[1])
df_ord_ord_dt.head(3)

Number of Rows:   518
Number of Columns:   8

,OrderDetailID,OrderID,ProductID,Quantity,CustomerID,EmployeeID,OrderDate,ShipperID
0,1,10248,11,12,90,5,1996-07-04,3
1,2,10248,42,10,90,5,1996-07-04,3
2,3,10248,72,5,90,5,1996-07-04,3

<h3>Save Dataframe to <i>5.3_Part1.csv</i></h3>

In [70]:
df_ord_ord_dt.to_csv("Data/5.3_Part1.csv", index=False)

In [71]:
#Test

df_test = pd.read_csv("Data/5.3_Part1.csv")

print("Number of Rows:  ", df_test.shape[0])
print("Number of Columns:  ", df_test.shape[1])
df_test.head()

Number of Rows:   518
Number of Columns:   8

,OrderDetailID,OrderID,ProductID,Quantity,CustomerID,EmployeeID,OrderDate,ShipperID
0,1,10248,11,12,90,5,1996-07-04,3
1,2,10248,42,10,90,5,1996-07-04,3
2,3,10248,72,5,90,5,1996-07-04,3
3,4,10249,14,9,81,6,1996-07-05,1
4,5,10249,51,40,81,6,1996-07-05,1